# NoFittingLoadedInProjectError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..NoFittingLoadedInProjectError Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
The fitting that is converted to was not defined. Please load one fitting family and assign it in the routing preference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoFittingLoadedInProjectError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoFittingLoadedInProjectError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoFittingLoadedInProjectError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace